cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>AESAXDIN</name>
                  <displayName>XDIN</displayName>
                  <description>AES Accelerator XORed Data In Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESXDIN0x</name>
                        <description>AES data in byte n when AESAXDIN is written as half-word</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AESXDIN1x</name>
                        <description>AES data in byte n+1 when AESAXDIN is written as half-word</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESAXIN</name>
                  <displayName>XIN</displayName>
                  <description>AES Accelerator XORed Data In Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESXIN0x</name>
                        <description>AES data in byte n when AESAXIN is written as half-word</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AESXIN1x</name>
                        <description>AES data in byte n+1 when AESAXIN is written as half-word</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>CRC32</name>
        <version>356.0</version>
        <description>CRC32</description>
        <baseAddress>0x40004000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>CRC32DI</name>
                  <displayName>CRC32DI</displayName>
                  <description>Data Input for CRC32 Signature Computation</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32DI</name>
                        <description>Data input register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC32DIRB</name>
                  <displayName>CRC32DIRB</displayName>
                  <description>Data In Reverse for CRC32 Computation</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32DIRB</name>
                        <description>Data input register reversed</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC32INIRES_LO</name>
                  <displayName>CRC32INIRES_LO</displayName>
                  <description>CRC32 Initialization and Result, lower 16 bits</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32INIRES_LO</name>
                        <description>CRC32 initialization and result, lower 16 bits</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC32INIRES_HI</name>
                  <displayName>CRC32INIRES_HI</displayName>
                  <description>CRC32 Initialization and Result, upper 16 bits</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32INIRES_HI</name>
                        <description>CRC32 initialization and result, upper 16 bits</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC32RESR_LO</name>
                  <displayName>CRC32RESR_LO</displayName>
                  <description>CRC32 Result Reverse, lower 16 bits</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x0000ffff</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32RESR_LO</name>
                        <description>CRC32 reverse result, lower 16 bits</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC32RESR_HI</name>
                  <displayName>CRC32RESR_HI</displayName>
                  <description>CRC32 Result Reverse, Upper 16 bits</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x0000ffff</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC32RESR_HI</name>
                        <description>CRC32 reverse result, upper 16 bits</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC16DI</name>
                  <displayName>CRC16DI</displayName>
                  <description>Data Input for CRC16 computation</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC16DI</name>
                        <description>CRC16 data in</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC16DIRB</name>
                  <displayName>CRC16DIRB</displayName>
                  <description>CRC16 Data In Reverse</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC16DIRB</name>
                        <description>CRC16 data in reverse byte</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC16INIRES</name>
                  <displayName>CRC16INIRES</displayName>
                  <description>CRC16 Initialization and Result register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x0000ffff</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC16INIRES</name>
                        <description>CRC16 initialization and result</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CRC16RESR</name>
                  <displayName>CRC16RESR</displayName>
                  <description>CRC16 Result Reverse</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x0000ffff</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CRC16RESR</name>
                        <description>CRC16 reverse result</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
