cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>P7IV</name>
                  <displayName>P7IV</displayName>
                  <description>Port 7 Interrupt Vector Register</description>
                  <addressOffset>0x6E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7IV</name>
                        <description>Port 7 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P7IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P7IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_2</name>
                                <description>Interrupt Source: Port 7.0 interrupt; Interrupt Flag: P7IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_4</name>
                                <description>Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_6</name>
                                <description>Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_8</name>
                                <description>Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_10</name>
                                <description>Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_12</name>
                                <description>Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_14</name>
                                <description>Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P7IV_16</name>
                                <description>Interrupt Source: Port 7.7 interrupt; Interrupt Flag: P7IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDSELC</name>
                  <displayName>PDSELC</displayName>
                  <description>Port D Complement Select</description>
                  <addressOffset>0x76</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7SELC</name>
                        <description>Port 7 Complement Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8SELC</name>
                        <description>Port 8 Complement Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDIES</name>
                  <displayName>PDIES</displayName>
                  <description>Port D Interrupt Edge Select</description>
                  <addressOffset>0x78</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P7IES</name>
                        <description>Port 7 Interrupt Edge Select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8IES</name>
                        <description>Port 8 Interrupt Edge Select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDIE</name>
                  <displayName>PDIE</displayName>
                  <description>Port D Interrupt Enable</description>
                  <addressOffset>0x7A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7IE</name>
                        <description>Port 7 Interrupt Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8IE</name>
                        <description>Port 8 Interrupt Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PDIFG</name>
                  <displayName>PDIFG</displayName>
                  <description>Port D Interrupt Flag</description>
                  <addressOffset>0x7C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P7IFG</name>
                        <description>Port 7 Interrupt Flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P8IFG</name>
                        <description>Port 8 Interrupt Flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P8IV</name>
                  <displayName>P8IV</displayName>
                  <description>Port 8 Interrupt Vector Register</description>
                  <addressOffset>0x7E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>P8IV</name>
                        <description>Port 8 interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>P8IV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>P8IV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_2</name>
                                <description>Interrupt Source: Port 8.0 interrupt; Interrupt Flag: P8IFG0; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_4</name>
                                <description>Interrupt Source: Port 8.1 interrupt; Interrupt Flag: P8IFG1</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_6</name>
                                <description>Interrupt Source: Port 8.2 interrupt; Interrupt Flag: P8IFG2</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_8</name>
                                <description>Interrupt Source: Port 8.3 interrupt; Interrupt Flag: P8IFG3</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_10</name>
                                <description>Interrupt Source: Port 8.4 interrupt; Interrupt Flag: P8IFG4</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_12</name>
                                <description>Interrupt Source: Port 8.5 interrupt; Interrupt Flag: P8IFG5</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_14</name>
                                <description>Interrupt Source: Port 8.6 interrupt; Interrupt Flag: P8IFG6</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>P8IV_16</name>
                                <description>Interrupt Source: Port 8.7 interrupt; Interrupt Flag: P8IFG7; Interrupt Priority: Lowest</description>
                                <value>16</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEIN</name>
                  <displayName>PEIN</displayName>
                  <description>Port E Input</description>
                  <addressOffset>0x80</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P9IN</name>
                        <description>Port 9 Input</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>P10IN</name>
                        <description>Port 10 Input</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEOUT</name>
                  <displayName>PEOUT</displayName>
                  <description>Port E Output</description>
                  <addressOffset>0x82</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>P9OUT</name>
                        <description>Port 9 Output</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10OUT</name>
                        <description>Port 10 Output</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEDIR</name>
                  <displayName>PEDIR</displayName>
                  <description>Port E Direction</description>
                  <addressOffset>0x84</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9DIR</name>
                        <description>Port 9 Direction</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10DIR</name>
                        <description>Port 10 Direction</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEREN</name>
                  <displayName>PEREN</displayName>
                  <description>Port E Resistor Enable</description>
                  <addressOffset>0x86</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9REN</name>
                        <description>Port 9 Resistor Enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10REN</name>
                        <description>Port 10 Resistor Enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PEDS</name>
                  <displayName>PEDS</displayName>
                  <description>Port E Drive Strength</description>
                  <addressOffset>0x88</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>P9DS</name>
                        <description>Port 9 Drive Strength</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10DS</name>
                        <description>Port 10 Drive Strength</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PESEL0</name>
                  <displayName>PESEL0</displayName>
                  <description>Port E Select 0</description>
                  <addressOffset>0x8A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9SEL0</name>
                        <description>Port 9 Select 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10SEL0</name>
                        <description>Port 10 Select 0</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>PESEL1</name>
                  <displayName>PESEL1</displayName>
                  <description>Port E Select 1</description>
                  <addressOffset>0x8C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>P9SEL1</name>
                        <description>Port 9 Select 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P10SEL1</name>
                        <description>Port 10 Select 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
