cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>LCDBMCTL</name>
                  <displayName>BMCTL</displayName>
                  <description>LCD_F blinking and memory control</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDBLKMODx</name>
                        <description>Blinking mode</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKMODx_0</name>
                                <description>Blinking disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKMODx_1</name>
                                <description>Blinking of individual segments as enabled in blinking memory register LCDBMx.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKMODx_2</name>
                                <description>Blinking of all segments</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKMODx_3</name>
                                <description>Switching between display contents as stored in LCDMx and LCDBMx memory registers.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDBLKPREx</name>
                        <description>Clock pre-scaler for blinking frequency</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKPREx_0</name>
                                <description>Divide by 512</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_1</name>
                                <description>Divide by 1024</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_2</name>
                                <description>Divide by 2048</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_3</name>
                                <description>Divide by 4096</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_4</name>
                                <description>Divide by 8162</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_5</name>
                                <description>Divide by 16384</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_6</name>
                                <description>Divide by 32768</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKPREx_7</name>
                                <description>Divide by 65536</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDBLKDIVx</name>
                        <description>Clock divider for blinking frequency</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_0</name>
                                <description>Divide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_1</name>
                                <description>Divide by 2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_2</name>
                                <description>Divide by 3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_3</name>
                                <description>Divide by 4</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_4</name>
                                <description>Divide by 5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_5</name>
                                <description>Divide by 6</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_6</name>
                                <description>Divide by 7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKDIVx_7</name>
                                <description>Divide by 8</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDDISP</name>
                        <description>Select LCD memory registers for display</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDDISP_0</name>
                                <description>Display content of LCD memory registers LCDMx</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDISP_1</name>
                                <description>Display content of LCD blinking memory registers LCDBMx</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCLRM</name>
                        <description>Clear LCD memory</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCLRM_0</name>
                                <description>Contents of LCD memory registers LCDMx remain unchanged</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCLRM_1</name>
                                <description>Clear content of all LCD memory registers LCDMx</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDCLRBM</name>
                        <description>Clear LCD blinking memory</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDCLRBM_0</name>
                                <description>Contents of blinking memory registers LCDBMx remain unchanged</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDCLRBM_1</name>
                                <description>Clear content of all blinking memory registers LCDBMx</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>LCDVCTL</name>
                  <displayName>VCTL</displayName>
                  <description>LCD_F voltage control</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCD2B</name>
                        <description>Bias select.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCD2B_0</name>
                                <description>1/3 bias</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCD2B_1</name>
                                <description>For 5-mux to 8-mux modes:1/2 bias. For 5-mux to 8-mux modes - 1/4 bias.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDEXTBIAS</name>
                        <description>V2 to V4 voltage select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDEXTBIAS_0</name>
                                <description>V2 to V4 are generated internally</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDEXTBIAS_1</name>
                                <description>V2 to V4 are sourced externally and the internal bias generator is switched off</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R03EXT</name>
                        <description>V5 voltage select</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>R03EXT_0</name>
                                <description>V5 is VSS</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>R03EXT_1</name>
                                <description>V5 is sourced from the R03 pin</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDREXT</name>
                        <description>V2 to V4 voltage on external Rx3 pins</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDREXT_0</name>
                                <description>Internally generated V2 to V4 are not switched to pins (LCDEXTBIAS = 0)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDREXT_1</name>
                                <description>Internally generated V2 to V4 are switched to pins (LCDEXTBIAS = 0)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
