cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>LCDIFG</name>
                  <displayName>IFG</displayName>
                  <description>LCD_F interrupt flag register</description>
                  <addressOffset>0x114</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDBLKOFFIFG</name>
                        <description>LCD Blink, segments off interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKOFFIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKOFFIFG_1</name>
                                <description>Interrupt due to LCD Blink, segments on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDBLKONIFG</name>
                        <description>LCD Blink, segments on interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDBLKONIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDBLKONIFG_1</name>
                                <description>Interrupt due to LCD Blink, segments on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDFRMIFG</name>
                        <description>LCD Frame interrupt flag</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDFRMIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDFRMIFG_1</name>
                                <description>Interrupt due to LCD frame</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMSTPIFG</name>
                        <description>LCD Animation step interrupt flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMSTPIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMSTPIFG_1</name>
                                <description>Interrupt due to LCD Animation step on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDANMLOOPIFG</name>
                        <description>LCD Animation loop interrupt flag</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDANMLOOPIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDANMLOOPIFG_1</name>
                                <description>Interrupt due to LCD Animation loop on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>LCDSETIFG</name>
                  <displayName>SETIFG</displayName>
                  <description>LCD_F set interrupt flag register</description>
                  <addressOffset>0x118</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SETLCDBLKOFFIFG</name>
                        <description>Sets LCDBLKOFFIFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SETLCDBLKOFFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SETLCDBLKOFFIFG_1</name>
                                <description>Sets interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SETLCDBLKONIFG</name>
                        <description>Sets LCDBLKONIFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SETLCDBLKONIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SETLCDBLKONIFG_1</name>
                                <description>Sets interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SETLCDFRMIFG</name>
                        <description>Sets LCDFRMIFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SETLCDFRMIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SETLCDFRMIFG_1</name>
                                <description>Sets interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SETLCDANMSTPIFG</name>
                        <description>Sets LCDANMSTPIFG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SETLCDANMSTPIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SETLCDANMSTPIFG_1</name>
                                <description>Sets interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SETLCDANMLOOPIFG</name>
                        <description>Sets LCDANMLOOPIFG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SETLCDANMLOOPIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SETLCDANMLOOPIFG_1</name>
                                <description>Sets interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>LCDCLRIFG</name>
                  <displayName>CLRIFG</displayName>
                  <description>LCD_F clear interrupt flag register</description>
                  <addressOffset>0x11C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>CLRLCDBLKOFFIFG</name>
                        <description>Clears LCDBLKOFFIFG</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CLRLCDBLKOFFIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRLCDBLKOFFIFG_1</name>
                                <description>Clears pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRLCDBLKONIFG</name>
                        <description>Clears LCDBLKONIFG</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CLRLCDBLKONIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRLCDBLKONIFG_1</name>
                                <description>Clears pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRLCDFRMIFG</name>
                        <description>Clears LCDFRMIFG</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CLRLCDFRMIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRLCDFRMIFG_1</name>
                                <description>Clears pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRLCDANMSTPIFG</name>
                        <description>Clears LCDANMSTPIFG</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CLRLCDANMSTPIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRLCDANMSTPIFG_1</name>
                                <description>Clears pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CLRLCDANMLOOPIFG</name>
                        <description>Clears LCDANMLOOPIFG</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CLRLCDANMLOOPIFG_0</name>
                                <description>No effect</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLRLCDANMLOOPIFG_1</name>
                                <description>Clears pending interrupt flag</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>48</dim>
                  <dimIncrement>1</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47</dimIndex>
                  <name>LCDM[%s]</name>
                  <displayName>M[%s]</displayName>
                  <description>LCD memory registers</description>
                  <addressOffset>0x120</addressOffset>
                  <size>8</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>LCDMEMORY</name>
                        <description>LCD Memory Contains LCD Segment on/off data for Line Lx if LCDSSx = 0 Contains COM assignment for Line Lx if LCDSSx = 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>48</dim>
                  <dimIncrement>1</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47</dimIndex>
                  <name>LCDBM[%s]</name>
                  <displayName>BM[%s]</displayName>
                  <description>LCD Blinking memory registers</description>
                  <addressOffset>0x160</addressOffset>
                  <size>8</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>LCDMEMORY</name>
                        <description>LCD Memory Contains LCD Segment on/off data for Line Lx if LCDSSx = 0 Contains COM assignment for Line Lx if LCDSSx = 1</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>8</dim>
                  <dimIncrement>1</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
                  <name>LCDANM[%s]</name>
                  <displayName>ANM[%s]</displayName>
                  <description>LCD Animation memory registers</description>
                  <addressOffset>0x1A0</addressOffset>
                  <size>8</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>LCDANIMMEMORY</name>
                        <description>LCD Animation memory Contains Animation data for animation step Tx</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
