cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>ITM</name>
        <version>356.0</version>
        <description>ITM</description>
        <baseAddress>0xE0000000</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>ITM_STIM0</name>
                  <displayName>STIM0</displayName>
                  <description>ITM Stimulus Port 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM1</name>
                  <displayName>STIM1</displayName>
                  <description>ITM Stimulus Port 1</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM2</name>
                  <displayName>STIM2</displayName>
                  <description>ITM Stimulus Port 2</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM3</name>
                  <displayName>STIM3</displayName>
                  <description>ITM Stimulus Port 3</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM4</name>
                  <displayName>STIM4</displayName>
                  <description>ITM Stimulus Port 4</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM5</name>
                  <displayName>STIM5</displayName>
                  <description>ITM Stimulus Port 5</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM6</name>
                  <displayName>STIM6</displayName>
                  <description>ITM Stimulus Port 6</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM7</name>
                  <displayName>STIM7</displayName>
                  <description>ITM Stimulus Port 7</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM8</name>
                  <displayName>STIM8</displayName>
                  <description>ITM Stimulus Port 8</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM9</name>
                  <displayName>STIM9</displayName>
                  <description>ITM Stimulus Port 9</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM10</name>
                  <displayName>STIM10</displayName>
                  <description>ITM Stimulus Port 10</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM11</name>
                  <displayName>STIM11</displayName>
                  <description>ITM Stimulus Port 11</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM12</name>
                  <displayName>STIM12</displayName>
                  <description>ITM Stimulus Port 12</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM13</name>
                  <displayName>STIM13</displayName>
                  <description>ITM Stimulus Port 13</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM14</name>
                  <displayName>STIM14</displayName>
                  <description>ITM Stimulus Port 14</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM15</name>
                  <displayName>STIM15</displayName>
                  <description>ITM Stimulus Port 15</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM16</name>
                  <displayName>STIM16</displayName>
                  <description>ITM Stimulus Port 16</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM17</name>
                  <displayName>STIM17</displayName>
                  <description>ITM Stimulus Port 17</description>
                  <addressOffset>0x44</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM18</name>
                  <displayName>STIM18</displayName>
                  <description>ITM Stimulus Port 18</description>
                  <addressOffset>0x48</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM19</name>
                  <displayName>STIM19</displayName>
                  <description>ITM Stimulus Port 19</description>
                  <addressOffset>0x4C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM20</name>
                  <displayName>STIM20</displayName>
                  <description>ITM Stimulus Port 20</description>
                  <addressOffset>0x50</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM21</name>
                  <displayName>STIM21</displayName>
                  <description>ITM Stimulus Port 21</description>
                  <addressOffset>0x54</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM22</name>
                  <displayName>STIM22</displayName>
                  <description>ITM Stimulus Port 22</description>
                  <addressOffset>0x58</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM23</name>
                  <displayName>STIM23</displayName>
                  <description>ITM Stimulus Port 23</description>
                  <addressOffset>0x5C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM24</name>
                  <displayName>STIM24</displayName>
                  <description>ITM Stimulus Port 24</description>
                  <addressOffset>0x60</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM25</name>
                  <displayName>STIM25</displayName>
                  <description>ITM Stimulus Port 25</description>
                  <addressOffset>0x64</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM26</name>
                  <displayName>STIM26</displayName>
                  <description>ITM Stimulus Port 26</description>
                  <addressOffset>0x68</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM27</name>
                  <displayName>STIM27</displayName>
                  <description>ITM Stimulus Port 27</description>
                  <addressOffset>0x6C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM28</name>
                  <displayName>STIM28</displayName>
                  <description>ITM Stimulus Port 28</description>
                  <addressOffset>0x70</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM29</name>
                  <displayName>STIM29</displayName>
                  <description>ITM Stimulus Port 29</description>
                  <addressOffset>0x74</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM30</name>
                  <displayName>STIM30</displayName>
                  <description>ITM Stimulus Port 30</description>
                  <addressOffset>0x78</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_STIM31</name>
                  <displayName>STIM31</displayName>
                  <description>ITM Stimulus Port 31</description>
                  <addressOffset>0x7C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>ITM_TER</name>
                  <displayName>TER</displayName>
                  <description>ITM Trace Enable Register</description>
                  <addressOffset>0xE00</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>STIMENA</name>
                        <description>Bit mask to enable tracing on ITM stimulus ports. One bit per stimulus port.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_TPR</name>
                  <displayName>TPR</displayName>
                  <description>ITM Trace Privilege Register</description>
                  <addressOffset>0xE40</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRIVMASK</name>
                        <description>Bit mask to enable tracing on ITM stimulus ports: bit [0] = stimulus ports [7:0], bit [1] = stimulus ports [15:8], bit [2] = stimulus ports [23:16], bit [3] = stimulus ports [31:24].</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_TCR</name>
                  <displayName>TCR</displayName>
                  <description>ITM Trace Control Register</description>
                  <addressOffset>0xE80</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ITMENA</name>
                        <description>Enable ITM. This is the master enable, and must be set before ITM Stimulus and Trace Enable registers can be written.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TSENA</name>
                        <description>Enables differential timestamps. Differential timestamps are emitted when a packet is written to the FIFO with a non-zero timestamp counter, and when the timestamp counter overflows. Timestamps are emitted during idle times after a fixed number of two million cycles. This provides a time reference for packets and inter-packet gaps. If SWOENA (bit [4]) is set, timestamps are triggered by activity on the internal trace bus only. In this case there is no regular timestamp output when the ITM is idle.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYNCENA</name>
                        <description>Enables sync packets for TPIU.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DWTENA</name>
                        <description>Enables the DWT stimulus.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWOENA</name>
                        <description>Enables asynchronous clocking of the timestamp counter.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TSPRESCALE</name>
                        <description>TSPrescale Timestamp prescaler.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>no prescaling</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>divide by 4</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>divide by 16</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>divide by 64</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ATBID</name>
                        <description>ATB ID for CoreSight system.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x7</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>Set when ITM events present and being drained.</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_IWR</name>
                  <displayName>IWR</displayName>
                  <description>ITM Integration Write Register</description>
                  <addressOffset>0xEF8</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ATVALIDM</name>
                        <description>When the integration mode is set: 0 = ATVALIDM clear. 1 = ATVALIDM set.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>ATVALIDM clear</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>ATVALIDM set</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_IMCR</name>
                  <displayName>IMCR</displayName>
                  <description>ITM Integration Mode Control Register</description>
                  <addressOffset>0xF00</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>INTEGRATION</name>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>ATVALIDM normal</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>ATVALIDM driven from Integration Write Register</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_LAR</name>
                  <displayName>LAR</displayName>
                  <description>ITM Lock Access Register</description>
                  <addressOffset>0xFB0</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>LOCK_ACCESS</name>
                        <description>A privileged write of 0xC5ACCE55 enables more write access to Control Register 0xE00::0xFFC. An invalid write removes write access.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ITM_LSR</name>
                  <displayName>LSR</displayName>
                  <description>ITM Lock Status Register</description>
                  <addressOffset>0xFB4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000003</resetValue>
                  <fields>
                    <field>
                        <name>PRESENT</name>
                        <description>Indicates that a lock mechanism exists for this component.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ACCESS</name>
                        <description>Write access to component is blocked. All writes are ignored, reads are permitted.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BYTEACC</name>
                        <description>You cannot implement 8-bit lock accesses.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
