cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
        </registers>
        <interrupt>
            <name>FPU_IRQ</name>
            <description>FPU Interrupt</description>
            <value>4</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>DHCSR</name>
                  <displayName>DHCSR</displayName>
                  <description>Debug Halting Control and Status Register</description>
                  <addressOffset>0xDF0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xfffeffff</resetMask>
                  <fields>
                    <field>
                        <name>C_DEBUGEN</name>
                        <description>Enables debug. This can only be written by AHB-AP and not by the core. It is ignored when written by the core, which cannot set or clear it. The core must write a 1 to it when writing C_HALT to halt itself.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_HALT</name>
                        <description>Halts the core. This bit is set automatically when the core Halts. For example Breakpoint. This bit clears on core reset. This bit can only be written if C_DEBUGEN is 1, otherwise it is ignored. When setting this bit to 1, C_DEBUGEN must also be written to 1 in the same value (value[1:0] is 2'b11). The core can halt itself, but only if C_DEBUGEN is already 1 and only if it writes with b11).</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_STEP</name>
                        <description>Steps the core in halted debug. When C_DEBUGEN = 0, this bit has no effect. Must only be modified when the processor is halted (S_HALT == 1).</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_MASKINTS</name>
                        <description>Mask interrupts when stepping or running in halted debug. Does not affect NMI, which is not maskable. Must only be modified when the processor is halted (S_HALT == 1). Also does not affect fault exceptions and SVC caused by execution of the instructions. CMASKINTS must be set or cleared before halt is released. This means that the writes to set or clear C_MASKINTS and to set or clear C_HALT must be separate.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_SNAPSTALL</name>
                        <description>If the core is stalled on a load/store operation the stall ceases and the instruction is forced to complete. This enables Halting debug to gain control of the core. It can only be set if: C_DEBUGEN = 1 and C_HALT = 1. The core reads S_RETIRE_ST as 0. This indicates that no instruction has advanced. This prevents misuse. The bus state is Unpredictable when this is used. S_RETIRE can detect core stalls on load/store operations.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S_REGRDY</name>
                        <description>Register Read/Write on the Debug Core Register Selector register is available. Last transfer is complete.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_HALT</name>
                        <description>The core is in debug state when S_HALT is set.</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_SLEEP</name>
                        <description>Indicates that the core is sleeping (WFI, WFE, or SLEEP-ON-EXIT). Must use C_HALT to gain control or wait for interrupt to wake-up.</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_LOCKUP</name>
                        <description>Reads as one if the core is running (not halted) and a lockup condition is present.</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_RETIRE_ST</name>
                        <description>Indicates that an instruction has completed since last read. This is a sticky bit that clears on read. This determines if the core is stalled on a load/store or fetch.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_RESET_ST</name>
                        <description>Indicates that the core has been reset, or is now being reset, since the last time this bit was read. This a sticky bit that clears on read. So, reading twice and getting 1 then 0 means it was reset in the past. Reading twice and getting 1 both times means that it is being reset now (held in reset still).</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DCRSR</name>
                  <displayName>DCRSR</displayName>
                  <description>Deubg Core Register Selector Register</description>
                  <addressOffset>0xDF4</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                    <field>
                        <name>REGSEL</name>
                        <description>Register select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00000</name>
                                <description>R0</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00001</name>
                                <description>R1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00010</name>
                                <description>R2</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00011</name>
                                <description>R3</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00100</name>
                                <description>R4</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00101</name>
                                <description>R5</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00110</name>
                                <description>R6</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b00111</name>
                                <description>R7</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01000</name>
                                <description>R8</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01001</name>
                                <description>R9</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01010</name>
                                <description>R10</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01011</name>
                                <description>R11</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01100</name>
                                <description>R12</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01101</name>
                                <description>Current SP</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01110</name>
                                <description>LR</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01111</name>
                                <description>DebugReturnAddress</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10000</name>
                                <description>xPSR/flags, execution state information, and exception number</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10001</name>
                                <description>MSP (Main SP)</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10010</name>
                                <description>PSP (Process SP)</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10100</name>
                                <description>CONTROL bits [31:24], FAULTMASK bits [23:16], BASEPRI bits [15:8], PRIMASK bits [7:0]</description>
                                <value>20</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>REGWNR</name>
                        <description>Write = 1, Read = 0</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DCRDR</name>
                  <displayName>DCRDR</displayName>
                  <description>Debug Core Register Data Register</description>
                  <addressOffset>0xDF8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
            </register>
            <register>
                  <name>DEMCR</name>
                  <displayName>DEMCR</displayName>
                  <description>Debug Exception and Monitor Control Register</description>
                  <addressOffset>0xDFC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>VC_CORERESET</name>
                        <description>Reset Vector Catch. Halt running system if Core reset occurs.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_MMERR</name>
                        <description>Debug trap on Memory Management faults.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_NOCPERR</name>
                        <description>Debug trap on Usage Fault access to Coprocessor that is not present or marked as not present in CAR register.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_CHKERR</name>
                        <description>Debug trap on Usage Fault enabled checking errors.</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_STATERR</name>
                        <description>Debug trap on Usage Fault state errors.</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_BUSERR</name>
                        <description>Debug Trap on normal Bus error.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_INTERR</name>
                        <description>Debug Trap on interrupt/exception service errors. These are a subset of other faults and catches before BUSERR or HARDERR.</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_HARDERR</name>
                        <description>Debug trap on Hard Fault.</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_EN</name>
                        <description>Enable the debug monitor. When enabled, the System handler priority register controls its priority level. If disabled, then all debug events go to Hard fault. C_DEBUGEN in the Debug Halting Control and Statue register overrides this bit. Vector catching is semi-synchronous. When a matching event is seen, a Halt is requested. Because the processor can only halt on an instruction boundary, it must wait until the next instruction boundary. As a result, it stops on the first instruction of the exception handler. However, two special cases exist when a vector catch has triggered: 1. If a fault is taken during vectoring, vector read or stack push error, the halt occurs on the corresponding fault handler, for the vector error or stack push. 2. If a late arriving interrupt comes in during vectoring, it is not taken. That is, an implementation that supports the late arrival optimization must suppress it in this case.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_PEND</name>
                        <description>Pend the monitor to activate when priority permits. This can wake up the monitor through the AHB-AP port. It is the equivalent to C_HALT for Monitor debug. This register does not reset on a system reset. It is only reset by a POR reset. Software in the reset handler or later, or by the DAP must enable the debug monitor.</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_STEP</name>
                        <description>When MON_EN = 1, this steps the core. When MON_EN = 0, this bit is ignored. This is the equivalent to C_STEP. Interrupts are only stepped according to the priority of the monitor and settings of PRIMASK, FAULTMASK, or BASEPRI.</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_REQ</name>
                        <description>This enables the monitor to identify how it wakes up. This bit clears on a Core Reset.</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>woken up by debug exception.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>woken up by MON_PEND</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TRCENA</name>
                        <description>This bit must be set to 1 to enable use of the trace and debug blocks: Data Watchpoint and Trace (DWT), Instrumentation Trace Macrocell (ITM), Embedded Trace Macrocell (ETM), Trace Port Interface Unit (TPIU). This enables control of power usage unless tracing is required. The application can enable this, for ITM use, or use by a debugger. Note that if no debug or trace components are present in the implementation then it is not possible to set TRCENA.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
