cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
        </registers>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>ICTR</name>
                  <displayName>ICTR</displayName>
                  <description>Interrupt Control Type Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>INTLINESNUM</name>
                        <description>Total number of interrupt lines in groups of 32.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ACTLR</name>
                  <displayName>ACTLR</displayName>
                  <description>Auxiliary Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>DISMCYCINT</name>
                        <description>Disables interruption of multi-cycle instructions. This increases the interrupt latency of the processor becuase LDM/STM completes before interrupt stacking occurs.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISDEFWBUF</name>
                        <description>Disables write buffer us during default memorty map accesses. This causes all bus faults to be precise bus faults but decreases the performance of the processor because the stores to memory have to complete before the next instruction can be executed.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISFOLD</name>
                        <description>Disables IT folding.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISFPCA</name>
                        <description>Disable automatic update of CONTROL.FPCA</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISOOFP</name>
                        <description>Disables floating point instructions completing out of order with respect to integer
instructions.</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
        </registers>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1000</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>ISER0</name>
                  <displayName>ISER0</displayName>
                  <description>Irq 0 to 31 Set Enable Register</description>
                  <addressOffset>0x100</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>SETENA</name>
                        <description>Writing 0 to a SETENA bit has no effect, writing 1 to a bit enables the corresponding interrupt. Reading the bit returns its current enable state. Reset clears the SETENA fields.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ISER1</name>
                  <displayName>ISER1</displayName>
                  <description>Irq 32 to 63 Set Enable Register</description>
                  <addressOffset>0x104</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>SETENA</name>
                        <description>Writing 0 to a SETENA bit has no effect, writing 1 to a bit enables the corresponding interrupt. Reading the bit returns its current enable state. Reset clears the SETENA fields.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ICER0</name>
                  <displayName>ICER0</displayName>
                  <description>Irq 0 to 31 Clear Enable Register</description>
                  <addressOffset>0x180</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>CLRENA</name>
                        <description>Writing 0 to a CLRENA bit has no effect, writing 1 to a bit disables the corresponding interrupt. Reading the bit returns its current enable state. Reset clears the CLRENA field.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ICER1</name>
                  <displayName>ICER1</displayName>
                  <description>Irq 32 to 63 Clear Enable Register</description>
                  <addressOffset>0x184</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>CLRENA</name>
                        <description>Writing 0 to a CLRENA bit has no effect, writing 1 to a bit disables the corresponding interrupt. Reading the bit returns its current enable state. Reset clears the CLRENA field.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ISPR0</name>
                  <displayName>ISPR0</displayName>
                  <description>Irq 0 to 31 Set Pending Register</description>
                  <addressOffset>0x200</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>SETPEND</name>
                        <description>Writing 0 to a SETPEND bit has no effect, writing 1 to a bit pends the corresponding interrupt. Reading the bit returns its current state.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ISPR1</name>
                  <displayName>ISPR1</displayName>
                  <description>Irq 32 to 63 Set Pending Register</description>
                  <addressOffset>0x204</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>SETPEND</name>
                        <description>Writing 0 to a SETPEND bit has no effect, writing 1 to a bit pends the corresponding interrupt. Reading the bit returns its current state.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ICPR0</name>
                  <displayName>ICPR0</displayName>
                  <description>Irq 0 to 31 Clear Pending Register</description>
                  <addressOffset>0x280</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>CLRPEND</name>
                        <description>Writing 0 to a CLRPEND bit has no effect, writing 1 to a bit clears the corresponding pending interrupt. Reading the bit returns its current state.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ICPR1</name>
                  <displayName>ICPR1</displayName>
                  <description>Irq 32 to 63 Clear Pending Register</description>
                  <addressOffset>0x284</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>CLRPEND</name>
                        <description>Writing 0 to a CLRPEND bit has no effect, writing 1 to a bit clears the corresponding pending interrupt. Reading the bit returns its current state.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IABR0</name>
                  <displayName>IABR0</displayName>
                  <description>Irq 0 to 31 Active Bit Register</description>
                  <addressOffset>0x300</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ACTIVE</name>
                        <description>Interrupt active flags. Reading 0 implies the interrupt is not active or stacked.  Reading 1 implies the interrupt is active or pre-empted and stacked.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IABR1</name>
                  <displayName>IABR1</displayName>
                  <description>Irq 32 to 63 Active Bit Register</description>
                  <addressOffset>0x304</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>ACTIVE</name>
                        <description>Interrupt active flags. Reading 0 implies the interrupt is not active or stacked.  Reading 1 implies the interrupt is active or pre-empted and stacked.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR0</name>
                  <displayName>IPR0</displayName>
                  <description>Irq 0 to 3 Priority Register</description>
                  <addressOffset>0x400</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_0</name>
                        <description>Priority of interrupt 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_1</name>
                        <description>Priority of interrupt 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_2</name>
                        <description>Priority of interrupt 2</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_3</name>
                        <description>Priority of interrupt 3</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR1</name>
                  <displayName>IPR1</displayName>
                  <description>Irq 4 to 7 Priority Register</description>
                  <addressOffset>0x404</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_4</name>
                        <description>Priority of interrupt 4</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_5</name>
                        <description>Priority of interrupt 5</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_6</name>
                        <description>Priority of interrupt 6</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_7</name>
                        <description>Priority of interrupt 7</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR2</name>
                  <displayName>IPR2</displayName>
                  <description>Irq 8 to 11 Priority Register</description>
                  <addressOffset>0x408</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_8</name>
                        <description>Priority of interrupt 8</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_9</name>
                        <description>Priority of interrupt 9</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_10</name>
                        <description>Priority of interrupt 10</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_11</name>
                        <description>Priority of interrupt 11</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR3</name>
                  <displayName>IPR3</displayName>
                  <description>Irq 12 to 15 Priority Register</description>
                  <addressOffset>0x40C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_12</name>
                        <description>Priority of interrupt 12</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_13</name>
                        <description>Priority of interrupt 13</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_14</name>
                        <description>Priority of interrupt 14</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_15</name>
                        <description>Priority of interrupt 15</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>IPR4</name>
                  <displayName>IPR4</displayName>
                  <description>Irq 16 to 19 Priority Register</description>
                  <addressOffset>0x410</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>PRI_16</name>
                        <description>Priority of interrupt 16</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_17</name>
                        <description>Priority of interrupt 17</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_18</name>
                        <description>Priority of interrupt 18</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_19</name>
                        <description>Priority of interrupt 19</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
