cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>ISAR4</name>
                  <displayName>ISAR4</displayName>
                  <description>ISA Feature register4</description>
                  <addressOffset>0xD70</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x01310102</resetValue>
                  <fields>
                    <field>
                        <name>UNPRIV_INSTRS</name>
                        <description>Unprivileged instructions</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no "T variant" instructions exist</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds LDRBT, LDRT, STRBT, STRT</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds LDRHT, LDRSBT, LDRSHT, STRHT</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WITHSHIFTS_INSTRS</name>
                        <description>WithShift instructions. Note that all additions only apply in cases where the encoding supports them - e.g. there is no difference between levels 3 and 4 in the Thumb-2 instruction set. Also note that MOV instructions with shift options should instead be treated as ASR, LSL, LSR, ROR or RRX instructions.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>non-zero shifts only support MOV and shift instructions (see notes)</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>shifts of loads/stores over the range LSL 0-3</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>adds other constant shift options.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0100</name>
                                <description>adds register-controlled shift options.</description>
                                <value>4</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>WRITEBACK_INSTRS</name>
                        <description>Writeback instructions</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>only non-writeback addressing modes present, except that LDMIA/STMDB/PUSH/POP instructions support writeback addressing.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds all currently-defined writeback addressing modes (ARMv7, Thumb-2)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BARRIER_INSTRS</name>
                        <description>Barrier instructions</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no barrier instructions supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds DMB, DSB, ISB barrier instructions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SYNCPRIM_INSTRS_FRAC</name>
                        <description>SyncPrim_instrs_frac</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>no additional support</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>adds CLREX, LDREXB, STREXB, LDREXH, STREXH</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PSR_M_INSTRS</name>
                        <description>PSR_M_instrs</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>instructions not present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>adds CPS, MRS, and MSR instructions (M-profile forms)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>CPACR</name>
                  <displayName>CPACR</displayName>
                  <description>Coprocessor Access Control Register</description>
                  <addressOffset>0xD88</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>CP11</name>
                        <description>Access privileges for coprocessor 11. The possible values of each field are: 0b00 = Access denied. Any attempted access generates a NOCP UsageFault. 0b01 = Privileged access only. An unprivileged access generates a NOCP UsageFault. 0b10 = Reserved. 0b11 = Full access. Used in conjunction with the control for CP10, this controls access to the Floating Point Coprocessor.</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CP10</name>
                        <description>Access privileges for coprocessor 10. The possible values of each field are: 0b00 = Access denied. Any attempted access generates a NOCP UsageFault. 0b01 = Privileged access only. An unprivileged access generates a NOCP UsageFault. 0b10 = Reserved. 0b11 = Full access. Used in conjunction with the control for CP11, this controls access to the Floating Point Coprocessor.</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
