cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
            <register>
                  <name>SYS_PERIHALT_CTL</name>
                  <displayName>PERIHALT_CTL</displayName>
                  <description>Peripheral Halt Control Register</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00004000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>HALT_T16_0</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_T16_0_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_T16_0_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_T16_1</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_T16_1_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_T16_1_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_T16_2</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_T16_2_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_T16_2_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_T16_3</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_T16_3_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_T16_3_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_T32_0</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_T32_0_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_T32_0_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUA0</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUA0_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUA0_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUA1</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUA1_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUA1_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUA2</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUA2_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUA2_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUA3</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUA3_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUA3_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUB0</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUB0_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUB0_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUB1</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUB1_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUB1_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUB2</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUB2_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUB2_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_eUB3</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_eUB3_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_eUB3_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_ADC</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_ADC_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_ADC_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_WDT</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_WDT_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_WDT_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_DMA</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_DMA_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_DMA_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HALT_LCD</name>
                        <description>Freezes IP operation when CPU is halted</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>HALT_LCD_0</name>
                                <description>IP operation unaffected when CPU is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HALT_LCD_1</name>
                                <description>freezes IP operation when CPU is halted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_SIZE</name>
                  <displayName>SRAM_SIZE</displayName>
                  <description>SRAM Size Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Indicates the size of SRAM on the device</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_NUMBANKS</name>
                  <displayName>SRAM_NUMBANKS</displayName>
                  <description>SRAM Number of Banks Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>NUM</name>
                        <description>Indicates the number of SRAM banks on the device.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_NUMBLOCKS</name>
                  <displayName>SRAM_NUMBLOCKS</displayName>
                  <description>SRAM Number of Blocks Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>NUM</name>
                        <description>Indicates the number of SRAM blocks on the device.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_MAINFLASH_SIZE</name>
                  <displayName>MAINFLASH_SIZE</displayName>
                  <description>Flash Main Memory Size Register</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Flash main memory size</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_INFOFLASH_SIZE</name>
                  <displayName>INFOFLASH_SIZE</displayName>
                  <description>Flash Information Memory Size Register</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Flash information memory size</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_DIO_GLTFLT_CTL</name>
                  <displayName>DIO_GLTFLT_CTL</displayName>
                  <description>Digital I/O Glitch Filter Control Register</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000001</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>GLTCH_EN</name>
                        <description>Glitch filter enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>GLTCH_EN_0</name>
                                <description>Disables glitch filter on the digital I/Os</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>GLTCH_EN_1</name>
                                <description>Enables glitch filter on the digital I/Os</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
