cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
                        <description>When 1, enables Bank55 of the SRAM</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK55_EN_0</name>
                                <description>Disables Bank55 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK55_EN_1</name>
                                <description>Enables Bank55 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK56_EN</name>
                        <description>When 1, enables Bank56 of the SRAM</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK56_EN_0</name>
                                <description>Disables Bank56 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK56_EN_1</name>
                                <description>Enables Bank56 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK57_EN</name>
                        <description>When 1, enables Bank57 of the SRAM</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK57_EN_0</name>
                                <description>Disables Bank57 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK57_EN_1</name>
                                <description>Enables Bank57 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK58_EN</name>
                        <description>When 1, enables Bank58 of the SRAM</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK58_EN_0</name>
                                <description>Disables Bank58 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK58_EN_1</name>
                                <description>Enables Bank58 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK59_EN</name>
                        <description>When 1, enables Bank59 of the SRAM</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK59_EN_0</name>
                                <description>Disables Bank59 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK59_EN_1</name>
                                <description>Enables Bank59 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK60_EN</name>
                        <description>When 1, enables Bank60 of the SRAM</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK60_EN_0</name>
                                <description>Disables Bank60 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK60_EN_1</name>
                                <description>Enables Bank60 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK61_EN</name>
                        <description>When 1, enables Bank61 of the SRAM</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK61_EN_0</name>
                                <description>Disables Bank61 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK61_EN_1</name>
                                <description>Enables Bank61 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK62_EN</name>
                        <description>When 1, enables Bank62 of the SRAM</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK62_EN_0</name>
                                <description>Disables Bank62 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK62_EN_1</name>
                                <description>Enables Bank62 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK63_EN</name>
                        <description>When 1, enables Bank63 of the SRAM</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK63_EN_0</name>
                                <description>Disables Bank63 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK63_EN_1</name>
                                <description>Enables Bank63 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
