cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411Y.svd
                        <description>When 1, enables Bank87 of the SRAM</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK87_EN_0</name>
                                <description>Disables Bank87 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK87_EN_1</name>
                                <description>Enables Bank87 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK88_EN</name>
                        <description>When 1, enables Bank88 of the SRAM</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK88_EN_0</name>
                                <description>Disables Bank88 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK88_EN_1</name>
                                <description>Enables Bank88 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK89_EN</name>
                        <description>When 1, enables Bank89 of the SRAM</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK89_EN_0</name>
                                <description>Disables Bank89 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK89_EN_1</name>
                                <description>Enables Bank89 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK90_EN</name>
                        <description>When 1, enables Bank90 of the SRAM</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK90_EN_0</name>
                                <description>Disables Bank90 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK90_EN_1</name>
                                <description>Enables Bank90 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK91_EN</name>
                        <description>When 1, enables Bank91 of the SRAM</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK91_EN_0</name>
                                <description>Disables Bank91 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK91_EN_1</name>
                                <description>Enables Bank91 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK92_EN</name>
                        <description>When 1, enables Bank92 of the SRAM</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK92_EN_0</name>
                                <description>Disables Bank92 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK92_EN_1</name>
                                <description>Enables Bank92 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK93_EN</name>
                        <description>When 1, enables Bank93 of the SRAM</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK93_EN_0</name>
                                <description>Disables Bank93 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK93_EN_1</name>
                                <description>Enables Bank93 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK94_EN</name>
                        <description>When 1, enables Bank94 of the SRAM</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK94_EN_0</name>
                                <description>Disables Bank94 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK94_EN_1</name>
                                <description>Enables Bank94 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BNK95_EN</name>
                        <description>When 1, enables Bank95 of the SRAM</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BNK95_EN_0</name>
                                <description>Disables Bank95 of the SRAM</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNK95_EN_1</name>
                                <description>Enables Bank95 of the SRAM</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
